[
  {
    "id": "farm-machinery",
    "title": "Farm Machinery",
    "description": "Covers equipment, tractors, implements, and machinery systems used in modern agriculture."
  },
  {
    "id": "soil-water",
    "title": "Soil & Water Engineering",
    "description": "Focuses on irrigation, drainage, soil conservation, and water resource management for agriculture."
  },
  {
    "id": "agri-power",
    "title": "Agricultural Power",
    "description": "Includes power sources, engines, renewable systems, and energy optimization for farm operations."
  },
  {
    "id": "post-harvest",
    "title": "Post-Harvest Technology",
    "description": "Covers handling, storage, processing, and preservation of agricultural products."
  },
  {
    "id": "farm-structures",
    "title": "Farm Structures",
    "description": "Deals with design and construction of agricultural buildings, storage systems, and rural structures."
  },
  {
    "id": "food-processing",
    "title": "Food Processing",
    "description": "Focuses on value addition, packaging, preservation technologies, and agro-industrial systems."
  },
  {
    "id": "agri-environment",
    "title": "Agricultural Environment",
    "description": "Includes environmental impact, sustainability, waste management, and climate-smart agriculture."
  },
  {
    "id": "precision-agriculture",
    "title": "Precision Agriculture",
    "description": "Covers GIS, remote sensing, IoT systems, automation, and smart farming technologies."
  },
  {
    "id": "bioenergy",
    "title": "Bioenergy",
    "description": "Focuses on biomass, biofuels, biogas, and renewable energy solutions for agriculture."
  },
  {
    "id": "climate-smart-agriculture",
    "title": "Climate Smart Agriculture",
    "description": "Deals with climate adaptation, mitigation, and resilient farming practices."
  },
  {
    "id": "agricultural-biotechnology",
    "title": "Agricultural Biotechnology",
    "description": "Includes genetic engineering, plant tissue culture, and biotechnology applications in agriculture."
  },
  {
    "id": "farm-management",
    "title": "Farm Management",
    "description": "Covers farm economics, decision-making tools, budgeting, and resource optimization."
  },
  {
    "id": "agri-automation",
    "title": "Agri Automation & Robotics",
    "description": "Involves automation systems, drones, sensors, and robotics used in agriculture."
  },
  {
    "id": "livestock-systems",
    "title": "Livestock Systems",
    "description": "Focuses on animal housing, feeding systems, waste management, and livestock technologies."
  },
  {
    "id": "renewable-resources",
    "title": "Renewable Resources",
    "description": "Covers sustainable natural resource management and eco-friendly agricultural technologies."
  },
  {
    "id": "aquaculture-systems",
    "title": "Aquaculture Systems",
    "description": "Deals with fish farming technologies, water quality management, and integrated aquaculture."
  },
  {
    "id": "rural-development",
    "title": "Rural Development",
    "description": "Includes rural infrastructure, community development, and extension services."
  },
  {
    "id": "agricultural-economics",
    "title": "Agricultural Economics",
    "description": "Covers agri-markets, supply chains, value chains, and economic analysis of farm systems."
  },
  {
    "id": "sustainable-agriculture",
    "title": "Sustainable Agriculture",
    "description": "Focuses on eco-friendly practices, biodiversity, and regenerative agriculture."
  },
  {
    "id": "hydrology",
    "title": "Hydrology & Watershed Engineering",
    "description": "Covers watersheds, hydrological modeling, runoff management, and conservation."
  },
  {
    "id": "geo-informatics",
    "title": "Geo-informatics",
    "description": "Covers GIS, GPS, spatial mapping, and remote sensing technologies."
  },
  {
    "id": "agri-policy",
    "title": "Agricultural Policy",
    "description": "Deals with agricultural laws, policies, government programs, and regulatory frameworks."
  },
  {
    "id": "crop-production-systems",
    "title": "Crop Production Systems",
    "description": "Covers agronomic systems, crop management techniques, and optimization of production."
  }
]
